<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"9377044c8786f696195154896b1fba30505376a96d6201c4e93a56d88f01c650","plan_job_ref":"Job ci #2163 at https://github.com/acm-uic/acm-uic.github.io/actions/runs/6093298709","plan_hash":"c3f44526b5e2ac0789e10bda49e75d4691aec0ab3a019c15e5dd824489b7fa83","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __tf__ in the __prod__ workspace<details open><summary>With variables</summary>

```hcl
typesense_api_key         = (sensitive value)
typesense_collection_name = (sensitive value)
typesense_rg              = "typesense-rg"
```
</details>
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.typesense_container_app will be created
  + resource "azurerm_container_app" "typesense_container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "typesense-container-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "typesense-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8108
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = "one"

          + container {
              + args              = []
              + command           = []
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "docker.io/typesense/typesense:0.24.0"
              + memory            = "2Gi"
              + name              = "typesense-acm-website"

              + env {
                  + name  = "TYPESENSE_DATA_DIR"
                  + value = "/data"
                }
              + env {
                  + name        = "TYPESENSE_API_KEY"
                  + secret_name = "api-key"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 10
                  + path                             = "/health"
                  + port                             = 8108
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 8108
                  + success_count_threshold = 3
                  + timeout                 = 1
                  + transport               = "HTTP"
                }

              + volume_mounts {
                  + name = "typesense-volume"
                  + path = "/data"
                }
            }

          + volume {
              + name         = "typesense-volume"
              + storage_name = "typesense-container-app-storage"
              + storage_type = "AzureFile"
            }
        }
    }

  # azurerm_container_app_environment.typesense_container_app_env will be created
  + resource "azurerm_container_app_environment" "typesense_container_app_env" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "northcentralus"
      + log_analytics_workspace_id       = "*************************************************************************************************************************************************"
      + name                             = "typesense-container-app-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "typesense-rg"
      + static_ip_address                = (known after apply)
    }

  # azurerm_container_app_environment_storage.typesense_container_app_env_storage will be created
  + resource "azurerm_container_app_environment_storage" "typesense_container_app_env_storage" {
      + access_key                   = (sensitive value)
      + access_mode                  = "ReadWrite"
      + account_name                 = "typesensestorage"
      + container_app_environment_id = (known after apply)
      + id                           = (known after apply)
      + name                         = "typesense-container-app-storage"
      + share_name                   = "typesense-share"
    }

  # azurerm_storage_share.typesense_storage_share will be updated in-place
  ~ resource "azurerm_storage_share" "typesense_storage_share" {
        id                   = "https://typesensestorage.file.core.windows.net/typesense-share"
        name                 = "typesense-share"
      ~ quota                = 1024 -> 100
        # (6 unchanged attributes hidden)
    }

  # shell_script.typesense_search_only_api_key must be replaced
-/+ resource "shell_script" "typesense_search_only_api_key" {
      ~ environment           = { # forces replacement
          - "COLLECTION_NAME" = (sensitive value)
          - "TYPESENSE_HOST"  = "typesense-container-app--one.jollyhill-e458c969.northcentralus.azurecontainerapps.io"
        } -> (known after apply) # forces replacement
      ~ id                    = "********************" -> (known after apply)
      ~ output                = {
          - "id"    = "*"
          - "value" = "bm4wGscrz9EpVYb6bQO0h3EFAqix1l13"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ typesense_container_app_fqdn  = "typesense-container-app.jollyhill-e458c969.northcentralus.azurecontainerapps.io" -> (known after apply)
  ~ typesense_search_only_api_key = "********************************" -> (known after apply)
```
</details>

:memo: Plan generated in [ci #2163](https://github.com/acm-uic/acm-uic.github.io/actions/runs/6093298709)